import re

# r"apple|banana"
pattern = "飒飒阿萨|阿萨|手机.{0,2}没电|手机关机|手机死机|等会.{0,2}注册|等会弄|一会弄|待会再弄|到时候再弄|回头再弄|待会整|等会整|一会整|待会再整|到时候再整|回头再整|待会搞|等会搞|一会搞|待会再搞|到时候再搞|回头再搞|手机|回头再搞手机|回头再弄/|/|回头在搞|回头|回头啊|奥特面|112|下次一定|等会儿|回头再搞|到时候再搞|待会再搞，现在不需要，下次再联系吧，有需要电话联系。。。。。。。。。。。。。。。。。。。。。。。。|一会搞|等会搞|待会搞|回头再整|到时候再整|待会再整|一会整|等会整|待会整|到时候再弄|待会再弄|一会弄|等会弄|等会.{0,2}注册|手机死机|手机关机|手机.{0,2没电111"
string = "等会弄."

match = re.search(pattern, string)
if match:
    matched_text = match.group()
    print("匹配成功：", matched_text)
else:
    print("匹配失败")
